Revit 2027 API
ParameterTypeId.CurveDeterminesOrientation Property
 "Determines Orientation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveDeterminesOrientation { get; }
Public Shared ReadOnly Property CurveDeterminesOrientation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveDeterminesOrientation {
	ForgeTypeId^ get ();
}
static member CurveDeterminesOrientation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace